/*Напиши скрипт який просить відвідувача ввести число в prompt до тих пір, поки відвідувач не натисне Cancel і кожен раз додає введене значення до загальної суми.

При завантаженні сторінки користувачеві пропонується в prompt ввести число. Введення додається до значення змінної total.
Операція введення числа триває до тих пір, поки користувач не натисне кнопку Cancel в prompt.
Після того як користувач припинив введення натиснувши кнопку Cancel, показати alert з рядком 'Загальна сума чисел дорівнює [сума]'.*/

let input;
let total = 0;

do {
    input = prompt('Введіть число');
    total += Number(input);
} while (input !== null);

alert(`Загальна сума чисел дорівнює ${total}`);