/*Користувач може оформити доставку товару до себе в країну, вказавши її при відвідуванні сторінки в prompt. Врахуй, користувач може ввести ім'я країни не тільки буквами нижнього регістра, а наприклад 'кИтАЙ'.

Напиши скрипт який виводить повідомлення про вартість доставки в зазначену країну. Обов'язково використовуй switch. Формат повідомлення: 'Доставка в [країна] буде коштувати [ціна] кредитів'.

Але доставка є не скрізь, якщо зазначеної країни немає в списку, то виводь в alert повідомлення 'У вашій країні доставка недоступна'.

Нижче наведено список країн і вартість доставки.

Китай - 100 кредитів
Чилі - 250 кредитів
Австралія - 170 кредитів
Індія - 80 кредитів
Ямайка - 120 кредитів*/



let totalPrise;
let country = prompt('Вкажіть назву країни');

switch (country.toLowerCase()) {
  case 'китай': {
    let totalPrice = 100;
    alert(`Доставка в ${country} буде коштувати ${totalPrice} кредитів`);
    break;
  }

  case 'чилі': {
    let totalPrice = 250;
    alert(`Доставка в ${country} буде коштувати  ${totalPrice} кредитів`);
    break;
  }

  case 'австралия': {
    let totalPrice = 170;
    alert(`Доставка в ${country} буде коштувати  ${totalPrice} кредитів`);
    break;
  }

  case 'индия': {
    let totalPrice = 80;
    alert(`Доставка в ${country} буде коштувати  ${totalPrice} кредитів`);
    break;
  }

  case 'ямайка': {
    let totalPrice = 120;
    alert(`Доставка в ${country} буде коштувати  ${totalPrice} кредитів`);
    break;
  }

  default:
    alert('У вашій країні доставка недоступна');
}